app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-30 12:25:03.811567"], ["id", 1]]
---
  def update
    data = params[:article].permit(:title, :description)
    @article = Article.find(params[:id])
    if @article.update_attributes(data)